https://www.mygreatlearning.com/blog/python-interview-questions/#basic

In [2]:
import numpy as np
import pandas as pd

In [1]:
## Concantenate tuplues
tup1=(4,"a",31)
tup2= (55, 9, "b")
tup1+tup2

In [11]:
## Initialize 5*5 array with only zeros
import numpy as np

np.zeros((5,5),dtype= int)

array([[0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0]])

In [12]:
## What is Series in pandas?
#Series is 1D data structure which can store data of any type

import pandas as pd
data=["1",2,"three",4.0,True]
series=pd.Series(data)
print(series)

0        1
1        2
2    three
3      4.0
4     True
dtype: object

In [13]:
##What is pandas groupby?
#it used to group data by classes, entities which can be further used for aggregation.
#A dataframe can be grouped by one or more columns.

df = pd.DataFrame({'Vehicle':['Etios','Lamborghini','Apache200','Pulsar220'], 'Type':["car","car","motorcycle","motorcycle"]})
df

       Vehicle        Type
0        Etios         car
1  Lamborghini         car
2    Apache200  motorcycle
3    Pulsar200  motorcycle

In [25]:
#Now using group by to group cars and motorcycles
a= df.groupby(by= 'Type').count()
a

            Vehicle
Type
car               2
motorcycle        2

In [117]:
bikes=["bajaj","tvs","herohonda","kawasaki","bmw"]
cars=["lamborghini","masserati","ferrari","hyundai","ford"]
a= pd.DataFrame([bikes,cars])
df= a.transpose()
df.columns=['bikes', 'cars']
print(df)
v=[]
for i in range(1,6):
    v.append(i)
ind= v
df.index= ind
df.set_index = (['bikes', 'cars'])

       bikes         cars
0      bajaj  lamborghini
1        tvs    masserati
2  herohonda      ferrari
3   kawasaki      hyundai
4        bmw         ford

In [135]:
#Dictionary
d={'a':(1,2),'b':2}
d['a']

d.keys()  #TO GET ALL THE KEYS
d.items()  #to get all the content

dict_items([('a', (1, 2)), ('b', 2)])

In [3]:
#How will you remove duplicates from a list?

list0= [1,1,2,3,2,4,7,8,6,6,5,5,5]
list1= list(set(list0))  #BY USING SET
list1

[1, 2, 3, 4, 5, 6, 7, 8]

In [47]:
## How to reverse a string?
str1= ('A P Dhillon')
str1[::-1]

'nollihD P A'

In [48]:
#Remove spaces from string
str1.replace(' ','')

'APDhillon'

In [17]:
#Given the following data frame drop rows having column values as A.
d={"col1":[1,2,3],"col2":["A","B","C"]}
df=pd.DataFrame(d)
df.index=['g','h','j']
df

   col1 col2
g     1    A
h     2    B
j     3    C

In [42]:
df1= df.copy()
df1= df1[df1.col2 !='A']
df1

   col1 col2
h     2    B
j     3    C

In [52]:
list(map(lambda x:x,range(8)))  #To print numbers in a list.

[0, 1, 2, 3, 4, 5, 6, 7]

In [4]:
def palin(abc):
    if abc== abc[::-1]:
        return ("num is palidrome")
    else:
        return ("not palin")

In [5]:
palin('mapm')

'not palin'

In [85]:
##Calculate sum of list of numbers

a= [3,14,5,6,9]
b= [4,7,15,24,1]

In [89]:
a[1]+b[1]

21

# Group BY

In [2]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [4]:
student_data

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [33]:
code = student_data.groupby("school_code")
type(code)

pandas.core.groupby.generic.DataFrameGroupBy

In [24]:
#Calculating mean, min and max values for age

code['age'].mean()  #min(), max()

school_code
s001    12.5
s002    13.0
s003    13.0
s004    12.0
Name: age, dtype: float64

In [32]:
#Write a Pandas program to split the following given dataframe into groups based on school code and class

cc= student_data.groupby(["school_code", "class"])

            0                                                  1
0   (s001, V)     school_code class            name date_Of_B...
1  (s001, VI)     school_code class          name date_Of_Bir...
2   (s002, V)     school_code class          name date_Of_Bir...
3  (s003, VI)     school_code class         name date_Of_Birt...
4  (s004, VI)     school_code class          name date_Of_Bir...

In [34]:
#Use get group 
code.get_group("s001")

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [3]:
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [8]:
df= orders_data.groupby("customer_id")
df['purch_amt'].mean()

customer_id
3001     270.65
3002    8870.86
3003      75.29
3004    1983.43
3005    1099.00
3007    2400.60
3008     250.45
3009    2590.90
Name: purch_amt, dtype: float64

In [16]:
df_agg = orders_data.groupby(["customer_id", "salesman_id"]).agg({'purch_amt':sum})
result = df_agg["purch_amt"].groupby(level =0, group_keys=False)
result.nlargest()

customer_id  salesman_id
3001         5005            270.65
3002         5001           8870.86
3003         5007             75.29
3004         5006           1983.43
3005         5002           1099.00
3007         5001           2400.60
3008         5002            250.45
3009         5003           2590.90
Name: purch_amt, dtype: float64

In [30]:
import datetime as dt

In [35]:
orders_data['ord_date'] = pd.to_datetime(orders_data['ord_date'])

In [36]:
orders_data.set_index('ord_date').groupby(pd.Grouper(freq='M'))

In [38]:
result['purch_amt'].sum()

ord_date
2012-04-30    3045.60
2012-05-31       0.00
2012-06-30     250.45
2012-07-31    2400.60
2012-08-31     185.79
2012-09-30    6979.15
2012-10-31    4679.59
Freq: M, Name: purch_amt, dtype: float64

In [1]:
from sklearn import datasets
import pandas as pd
import numpy as np

In [8]:
iris= datasets.load_iris()

In [10]:
iris_df= pd.DataFrame(iris.data)
iris_df['class']=iris.target
iris_df.columns=['sepal_len', 'sepal_wid', 'petal_len', 'petal_wid', 'class']

In [11]:
iris_df.head()

   sepal_len  sepal_wid  petal_len  petal_wid  class
0        5.1        3.5        1.4        0.2      0
1        4.9        3.0        1.4        0.2      0
2        4.7        3.2        1.3        0.2      0
3        4.6        3.1        1.5        0.2      0
4        5.0        3.6        1.4        0.2      0

In [12]:
group = iris_df.groupby(by= 'class')
group['petal_wid'].mean()

class
0    0.246
1    1.326
2    2.026
Name: petal_wid, dtype: float64